<?php

return [

    'name' => 'Панель керування',
    'general' => [
        'create' => 'Створити',
        'edit' => 'Редагувати',
        'delete' => 'Видалити',
        'save' => 'Зберігти',
        'yes' => 'Так',
        'no' => 'Ні'
    ],
    'title' => [
        'media' => [
            'index' => 'Медіа'
        ],
        'files' => [
            'index' => 'Файли'
        ],
        'user' => [
            'index' => 'Користувачі'
        ],
        'config' => [
            'index' => 'Налаштування'
        ],
        'dashboard' => 'Панель керування'
    ],
    'field' => [
        'file' => [
            'upload' => 'Завантажити',
            'select' => 'Обрати існуюче'
        ]
    ],
    'auth' => [
        'password' => 'Пароль',
        'username' => 'Ім\'я користувача',
        'remember_me' => 'Запам\'ятати мене',
        'sign_in' => 'Увійти'
    ],
    'flash' => [
        'crud' => [
            'updated' => 'Запис успішно оновлено',
            'created' => 'Запис успішно створено',
            'deleted' => 'Запис успішно видалено'
        ]
    ],
    'entity' => [
        'menu' => [
            'sidebar' => 'Меню',
            'page' => [
                'header' => 'Меню'
            ],
            'title' => [
                'index' => 'Меню',
                'create' => 'Створення нового меню',
                'edit' => 'Редагування меню'
            ],
            'field' => [
                'name' => 'Назва',
                'items' => 'Пункти меню',
                'categories' => 'Категорії',
                'location' => 'Розположення',
                'tag' => 'Ідентифікатор',
                'order' => 'Позиція'
            ],
            'locations' => [
                'header' => 'Верхнє меню',
                'left-sidebar' => 'Ліве меню',
                'right-sidebar' => 'Праве меню'
            ]
        ],
        'category' => [
            'sidebar' => 'Категорії',
            'page' => [
                'header' => 'Категорії'
            ],
            'title' => [
                'index' => 'Категорії',
                'create' => 'Створення нової категорії',
                'edit' => 'Редагування категорії'
            ],
            'field' => [
                'name' => 'Назва'
            ]
        ],
        'user' => [
            'sidebar' => 'Користувачі',
            'page' => [
                'header' => 'Користувачі'
            ],
            'title' => [
                'index' => 'Список користувачів',
                'create' => 'Створення користувача',
                'edit' => 'Редагування користувача'
            ],
            'field' => [
                'username' => 'І\'я користувача',
                'full_name' => 'Повне і\'мя користувача',
                'email' => 'Електрона пошта',
                'password' => 'Пароль'
            ]
        ]
    ],

    'menu' => [
        'media' => 'Медіа',
        'files' => 'Файли',
        'config' => 'Налаштування'
    ],

    'frontend' => [
        'popup' => [
            'file' => [
                'header' => 'Менеджер файлів'
            ]
        ]
    ]
];